siredmar/master/Teil A/software/linux/gnublin-lpc3131-3.3.0-master/linux-3.3.0-lpc313x/arch/arm/mach-lpc31xx/include/mach/registers.h
#define NS_TO_MPMCCLK(ns, clk)	(((ns)*((clk + 500)/1000) + 500000)/1000000)
/* MPMC Controller Bit Field constants*/
#define MPMC_CTL_LOW_PWR               _BIT(2)
#define MPMC_CTL_ENABLE                _BIT(0)
/* MPMC status Bit Field constants*/
#define MPMC_STATUS_SA                 _BIT(2)
#define MPMC_STATUS_WR_BUF             _BIT(1)
#define MPMC_STATUS_BUSY               _BIT(0)
/* MPMC config Bit Field constants*/
#define MPMC_CFG_SDCCLK_1_2            _BIT(8)
#define MPMC_CFG_SDCCLK_1_1            (0)
/* SDRAM Controller Bit Field constants*/
#define MPMC_SDRAMC_CTL_DP             _BIT(13)
#define MPMC_SDRAMC_CTL_NORMAL_CMD     _SBF(7,0)
#define MPMC_SDRAMC_CTL_MODE_CMD       _SBF(7,1)
#define MPMC_SDRAMC_CTL_PALL_CMD       _SBF(7,2)
#define MPMC_SDRAMC_CTL_NOP_CMD        _SBF(7,3)
#define MPMC_SDRAMC_CTL_MCC            _BIT(5)
#define MPMC_SDRAMC_CTL_SR             _BIT(2)
#define MPMC_SDRAMC_CTL_CS             _BIT(1)
#define MPMC_SDRAMC_CTL_CE             _BIT(0)
/* SDRAM Config Bit Field constants*/
#define MPMC_SDRAMC_CFG_SDRAM_MD       _SBF(3,0)
#define MPMC_SDRAMC_CFG_LOW_PWR_MD     _SBF(3,1)
#define MPMC_SDRAMC_CFG_SYNC_FLASH     _SBF(3,2)
#define MPMC_SDRAMC_CFG_BUF_EN         _BIT(19)
#define MPMC_SDRAMC_CFG_WP             _BIT(20)


/* SDRAM Read Config Bit Field constants*/
#define MPMC_SDRAMC_RDCFG_CLKOUTDELAY_STG       _SBF(0,0)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_STG          _SBF(0,1)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_P1_STG       _SBF(0,2)
#define MPMC_SDRAMC_RDCFG_CMDDELAY_P2_STG       _SBF(0,3)
/* SDRAM RASCAS Bit Field constants*/
#define MPMC_SDRAMC_RASCAS_CAS0        _SBF(8,0)
#define MPMC_SDRAMC_RASCAS_CAS1        _SBF(8,1)
#define MPMC_SDRAMC_RASCAS_CAS2        _SBF(8,2)
#define MPMC_SDRAMC_RASCAS_CAS3        _SBF(8,3)
#define MPMC_SDRAMC_RASCAS_RAS0        _SBF(0,0)
#define MPMC_SDRAMC_RASCAS_RAS1        _SBF(0,1)
#define MPMC_SDRAMC_RASCAS_RAS2        _SBF(0,2)
#define MPMC_SDRAMC_RASCAS_RAS3        _SBF(0,3)

/***********************************************************************
 * SD/MMC MCI register definitions
 **********************************************************************/
#define SDMMC_CTRL            __REG (SDMMC_PHYS + 0x000)
#define SDMMC_PWREN           __REG (SDMMC_PHYS + 0x004)
#define SDMMC_CLKDIV          __REG (SDMMC_PHYS + 0x008)
#define SDMMC_CLKSRC          __REG (SDMMC_PHYS + 0x00c)
#define SDMMC_CLKENA          __REG (SDMMC_PHYS + 0x010)
#define SDMMC_TMOUT           __REG (SDMMC_PHYS + 0x014)
#define SDMMC_CTYPE           __REG (SDMMC_PHYS + 0x018)
#define SDMMC_BLKSIZ          __REG (SDMMC_PHYS + 0x01c)
#define SDMMC_BYTCNT          __REG (SDMMC_PHYS + 0x020)
#define SDMMC_INTMASK         __REG (SDMMC_PHYS + 0x024)
#define SDMMC_CMDARG          __REG (SDMMC_PHYS + 0x028)
#define SDMMC_CMD             __REG (SDMMC_PHYS + 0x02c)
#define SDMMC_RESP0           __REG (SDMMC_PHYS + 0x030)
#define SDMMC_RESP1           __REG (SDMMC_PHYS + 0x034)
#define SDMMC_RESP2           __REG (SDMMC_PHYS + 0x038)
#define SDMMC_RESP3           __REG (SDMMC_PHYS + 0x03c)
#define SDMMC_MINTSTS         __REG (SDMMC_PHYS + 0x040)
#define SDMMC_RINTSTS         __REG (SDMMC_PHYS + 0x044)
#define SDMMC_STATUS          __REG (SDMMC_PHYS + 0x048)
#define SDMMC_FIFOTH          __REG (SDMMC_PHYS + 0x04c)
#define SDMMC_TCBCNT          __REG (SDMMC_PHYS + 0x05c)
#define SDMMC_TBBCNT          __REG (SDMMC_PHYS + 0x060)
#define SDMMC_DEBNCE          __REG (SDMMC_PHYS + 0x064)
#define SDMMC_USRID           __REG (SDMMC_PHYS + 0x068)
#define SDMMC_VERID           __REG (SDMMC_PHYS + 0x06c)
#define SDMMC_HCON            __REG (SDMMC_PHYS + 0x070)
#define SDMMC_DATA            __REG (SDMMC_PHYS + 0x100)
#define SDMMC_DATA_ADR        (SDMMC_PHYS + 0x100)

/* Control register defines */
#define SDMMC_CTRL_CEATA_INT_EN   _BIT(11)
#define SDMMC_CTRL_SEND_AS_CCSD   _BIT(10)
#define SDMMC_CTRL_SEND_CCSD      _BIT(9)
#define SDMMC_CTRL_ABRT_READ_DATA _BIT(8)
#define SDMMC_CTRL_SEND_IRQ_RESP  _BIT(7)
#define SDMMC_CTRL_READ_WAIT      _BIT(6)
#define SDMMC_CTRL_DMA_ENABLE     _BIT(5)
#define SDMMC_CTRL_INT_ENABLE     _BIT(4)
#define SDMMC_CTRL_DMA_RESET      _BIT(2)
#define SDMMC_CTRL_FIFO_RESET     _BIT(1)
#define SDMMC_CTRL_RESET          _BIT(0)
/* Clock Enable register defines */
#define SDMMC_CLKEN_LOW_PWR      _BIT(16)
#define SDMMC_CLKEN_ENABLE       _BIT(0)
/* time-out register defines */
#define SDMMC_TMOUT_DATA(n)      _SBF(8, (n))
#define SDMMC_TMOUT_DATA_MSK     0xFFFFFF00
#define SDMMC_TMOUT_RESP(n)      ((n) & 0xFF)
#define SDMMC_TMOUT_RESP_MSK     0xFF
/* card-type register defines */
#define SDMMC_CTYPE_8BIT         _BIT(16)
#define SDMMC_CTYPE_4BIT         _BIT(0)
/* Interrupt status & mask register defines */
#define SDMMC_INT_SDIO           _BIT(16)
#define SDMMC_INT_EBE            _BIT(15)
#define SDMMC_INT_ACD            _BIT(14)
#define SDMMC_INT_SBE            _BIT(13)
#define SDMMC_INT_HLE            _BIT(12)
#define SDMMC_INT_FRUN           _BIT(11)
#define SDMMC_INT_HTO            _BIT(10)
#define SDMMC_INT_DTO            _BIT(9)
#define SDMMC_INT_RTO            _BIT(8)
#define SDMMC_INT_DCRC           _BIT(7)
#define SDMMC_INT_RCRC           _BIT(6)
#define SDMMC_INT_RXDR           _BIT(5)
#define SDMMC_INT_TXDR           _BIT(4)
#define SDMMC_INT_DATA_OVER      _BIT(3)
#define SDMMC_INT_CMD_DONE       _BIT(2)
#define SDMMC_INT_RESP_ERR       _BIT(1)
#define SDMMC_INT_CD             _BIT(0)
#define SDMMC_INT_ERROR          0xbfc2
/* Command register defines */
#define SDMMC_CMD_START         _BIT(31)
#define SDMMC_CMD_CCS_EXP       _BIT(23)
#define SDMMC_CMD_CEATA_RD      _BIT(22)
#define SDMMC_CMD_UPD_CLK       _BIT(21)
#define SDMMC_CMD_INIT          _BIT(15)
#define SDMMC_CMD_STOP          _BIT(14)
#define SDMMC_CMD_PRV_DAT_WAIT  _BIT(13)
#define SDMMC_CMD_SEND_STOP     _BIT(12)
#define SDMMC_CMD_STRM_MODE     _BIT(11)
#define SDMMC_CMD_DAT_WR        _BIT(10)
#define SDMMC_CMD_DAT_EXP       _BIT(9)
#define SDMMC_CMD_RESP_CRC      _BIT(8)
#define SDMMC_CMD_RESP_LONG     _BIT(7)
#define SDMMC_CMD_RESP_EXP      _BIT(6)
#define SDMMC_CMD_INDX(n)       ((n) & 0x1F)
/* Status register defines */
#define SDMMC_GET_FCNT(x)       (((x)>>17) & 0x1FF)
#define SDMMC_FIFO_SZ           32


/***********************************************************************
 * NAND Controller register definitions
 **********************************************************************/
#define NAND_IRQSTATUS1                __REG (NANDC_PHYS + 0x000)
#define NAND_IRQMASK1                  __REG (NANDC_PHYS + 0x004)
#define NAND_IRQSTATUSRAW1             __REG (NANDC_PHYS + 0x008)
#define NAND_CONFIG                    __REG (NANDC_PHYS + 0x00C)
#define NAND_IOCONFIG                  __REG (NANDC_PHYS + 0x010)
#define NAND_TIMING1                   __REG (NANDC_PHYS + 0x014)
#define NAND_TIMING2                   __REG (NANDC_PHYS + 0x018)
#define NAND_SETCMD                    __REG (NANDC_PHYS + 0x020)
#define NAND_SETADDR                   __REG (NANDC_PHYS + 0x024)
#define NAND_WRITEDATA                 __REG (NANDC_PHYS + 0x028)
#define NAND_SETCE                     __REG (NANDC_PHYS + 0x02C)
#define NAND_READDATA                  __REG (NANDC_PHYS + 0x030)
#define NAND_CHECKSTS                  __REG (NANDC_PHYS + 0x034)
#define NAND_CONTROLFLOW               __REG (NANDC_PHYS + 0x038)
#define NAND_GPIO1                     __REG (NANDC_PHYS + 0x040)
#define NAND_GPIO2                     __REG (NANDC_PHYS + 0x044)
#define NAND_IRQSTATUS2                __REG (NANDC_PHYS + 0x048)
#define NAND_IRQMASK2                  __REG (NANDC_PHYS + 0x04C)
#define NAND_IRQSTATUSRAW2             __REG (NANDC_PHYS + 0x050)
#define NAND_ECCERRSTATUS              __REG (NANDC_PHYS + 0x078)

/* NAND internal SDRAM address definitions*/
#define NAND_BUFFER_ADRESS             __REG (IO_NAND_BUF_PHYS)

/* Register description of NANDIRQSTATUS1 */
#define NAND_NANDIRQSTATUS1_RB4_POS_EDGE       _BIT(31)
#define NAND_NANDIRQSTATUS1_RB3_POS_EDGE       _BIT(30)
#define NAND_NANDIRQSTATUS1_RB2_POS_EDGE       _BIT(29)
#define NAND_NANDIRQSTATUS1_RB1_POS_EDGE       _BIT(28)
#define NAND_NANDIRQSTATUS1_ERASED_RAM1        _BIT(27)
#define NAND_NANDIRQSTATUS1_ERASED_RAM0        _BIT(26)
#define NAND_NANDIRQSTATUS1_WR_RAM1            _BIT(25)
#define NAND_NANDIRQSTATUS1_WR_RAM0            _BIT(24)
#define NAND_NANDIRQSTATUS1_RD_RAM1            _BIT(23)
#define NAND_NANDIRQSTATUS1_RD_RAM0            _BIT(22)
#define NAND_NANDIRQSTATUS1_ECC_DEC_RAM0       _BIT(21)
#define NAND_NANDIRQSTATUS1_ECC_ENC_RAM0       _BIT(20)
#define NAND_NANDIRQSTATUS1_ECC_DEC_RAM1       _BIT(19)
#define NAND_NANDIRQSTATUS1_ECC_ENC_RAM1       _BIT(18)
#define NAND_NANDIRQSTATUS1_NOERR_RAM0         _BIT(17)
#define NAND_NANDIRQSTATUS1_ERR1_RAM0          _BIT(16)
#define NAND_NANDIRQSTATUS1_ERR2_RAM0          _BIT(15)
#define NAND_NANDIRQSTATUS1_ERR3_RAM0          _BIT(14)
#define NAND_NANDIRQSTATUS1_ERR4_RAM0          _BIT(13)
#define NAND_NANDIRQSTATUS1_ERR5_RAM0          _BIT(12)
#define NAND_NANDIRQSTATUS1_ERR_UNR_RAM0       _BIT(11)
#define NAND_NANDIRQSTATUS1_NOERR_RAM1         _BIT(10)
#define NAND_NANDIRQSTATUS1_ERR1_RAM1          _BIT(9)
#define NAND_NANDIRQSTATUS1_ERR2_RAM1          _BIT(8)
#define NAND_NANDIRQSTATUS1_ERR3_RAM1          _BIT(7)
#define NAND_NANDIRQSTATUS1_ERR4_RAM1          _BIT(6)
#define NAND_NANDIRQSTATUS1_ERR5_RAM1          _BIT(5)
#define NAND_NANDIRQSTATUS1_ERR_UNR_RAM1       _BIT(4)
#define NAND_NANDIRQSTATUS1_AES_DONE_RAM1      _BIT(1)
#define NAND_NANDIRQSTATUS1_AES_DONE_RAM0      _BIT(0)

/* Register description of NANDCONFIG */
#define NAND_NANDCONFIG_PEC                _BIT(15) /* Power off ECC clock*/
#define NAND_NANDCONFIG_ECGC               _BIT(13) /* Enable ECC clock gating*/
#define NAND_NANDCONFIG_8BIT_ECC           _BIT(12) /* ECC mode*/
#define NAND_NANDCONFIG_TL_528             _SBF(10, 0x0) /* Transfer limit*/
#define NAND_NANDCONFIG_TL_516             _SBF(10, 0x2) /* Transfer limit*/
#define NAND_NANDCONFIG_TL_512             _SBF(10, 0x3) /* Transfer limit*/
#define NAND_NANDCONFIG_TL_MASK            _SBF(10, 0x3) /* Transfer limit*/
#define NAND_NANDCONFIG_EO                 _BIT(9) /* */
#define NAND_NANDCONFIG_DC                 _BIT(8) /* Deactivate CE enable*/
#define NAND_NANDCONFIG_M                  _BIT(7) /* 512 mode*/
#define NAND_NANDCONFIG_LC_0               _SBF(5, 0x0) /* Latency Configuration: zero wait state*/
#define NAND_NANDCONFIG_LC_1               _SBF(5, 0x1) /* Latency Configuration: one wait state*/
#define NAND_NANDCONFIG_LC_2               _SBF(5, 0x2) /* Latency Configuration: two wait state*/
#define NAND_NANDCONFIG_LC_MASK            _SBF(5, 0x3) /* Latency Configuration*/
#define NAND_NANDCONFIG_ES                 _BIT(4) /* Endianess setting */
#define NAND_NANDCONFIG_DE                 _BIT(3) /* DMA external enable*/
#define NAND_NANDCONFIG_AO                 _BIT(2) /* */
#define NAND_NANDCONFIG_WD                 _BIT(1) /* Wide device*/
#define NAND_NANDCONFIG_EC                 _BIT(0) /* ECC on*/

/* Register description of NANDIOCONFIG */
#define NAND_NANDIOCONFIG_CFG_IO_DRIVE        _BIT(24) /* Nand IO drive default*/
#define NAND_NANDIOCONFIG_CFG_DATA_DEF(n)     _SBF(8, ((n) & 0xFFFF)) /* Data to nand default*/
#define NAND_NANDIOCONFIG_CFG_CLE_1           _SBF(6, 0x01) /* CLE default*/
#define NAND_NANDIOCONFIG_CFG_ALE_1           _SBF(4, 0x01) /* ALE default*/
#define NAND_NANDIOCONFIG_CFG_WE_1            _SBF(2, 0x01) /* WE_n default*/
#define NAND_NANDIOCONFIG_CFG_RE_1            _SBF(0, 0x01) /* RE_n default*/

/* Register description of NANDTIMING1 */
#define NAND_NANDTIMING1_DEFAULT		   (0x000FFFFF)
#define NAND_NANDTIMING1_TSRD(n)           _SBF(20, ((n) & 0x3)) /* Single data input delay*/
#define NAND_NANDTIMING1_TALS(n)           _SBF(16, ((n) & 0x7)) /* Address setup time*/
#define NAND_NANDTIMING1_TALH(n)           _SBF(12, ((n) & 0x7)) /* Address hold time*/
#define NAND_NANDTIMING1_TCLS(n)           _SBF(4, ((n) & 0x7)) /* Command setup time*/
#define NAND_NANDTIMING1_TCLH(n)           ((n) & 0x7) /* Command hold time*/

/* Register description of NANDTIMING2 */
#define NAND_NANDTIMING2_DEFAULT		   (0xFFFFFFFF)
#define NAND_NANDTIMING2_TDRD(n)           _SBF(28, ((n) & 0x7)) /* Data input delay*/
#define NAND_NANDTIMING2_TEBI(n)           _SBF(24, ((n) & 0x7)) /* EBI delay time*/
#define NAND_NANDTIMING2_TCH(n)            _SBF(20, ((n) & 0x7)) /* Chip select hold time*/
#define NAND_NANDTIMING2_TCS(n)            _SBF(16, ((n) & 0x7)) /* Chip select setup time*/
#define NAND_NANDTIMING2_TRH(n)            _SBF(12, ((n) & 0x7)) /* Read enable high hold*/
#define NAND_NANDTIMING2_TRP(n)            _SBF(8, ((n) & 0x7)) /* Read enable pulse width*/
#define NAND_NANDTIMING2_TWH(n)            _SBF(4, ((n) & 0x7)) /* Write enable high hold*/
#define NAND_NANDTIMING2_TWP(n)            ((n) & 0x7) /* Write enable pulse width*/

/* Register description of NANDSETCE */
#define NAND_NANDSETCE_OVR_EN(n)        _BIT(((n) & 0x3) + 12) /* */
#define NAND_NANDSETCE_OVR_V(n)         _BIT(((n) & 0x3) + 8) /* */
#define NAND_NANDSETCE_WP               _BIT(4) /* WP_n pin value*/
#define NAND_NANDSETCE_CV_MASK          0x0F /* Chip select value*/
#define NAND_NANDSETCE_CV(n)            (0x0F & ~_BIT(((n) & 0x3))) /* Chip select value*/
#define NAND_NANDSETCE_CV0              _BIT(0)

/* Register description of NANDCHECKSTS */
#define NAND_NANDCHECKSTS_RB4_EDGE       _BIT(8) /* mNAND_RYBN3 rising edge*/
#define NAND_NANDCHECKSTS_RB3_EDGE       _BIT(7) /* mNAND_RYBN2 rising edge*/
#define NAND_NANDCHECKSTS_RB2_EDGE       _BIT(6) /* mNAND_RYBN1 rising edge*/
#define NAND_NANDCHECKSTS_RB1_EDGE       _BIT(5) /* mNAND_RYBN0 rising edge*/
#define NAND_NANDCHECKSTS_RB4_LVL        _BIT(4) /* mNAND_RYBN3 value*/
#define NAND_NANDCHECKSTS_RB3_LVL        _BIT(3) /* mNAND_RYBN2 value*/
#define NAND_NANDCHECKSTS_RB2_LVL        _BIT(2) /* mNAND_RYBN1 value*/
#define NAND_NANDCHECKSTS_RB1_LVL        _BIT(1) /* mNAND_RYBN0 value*/
#define NAND_NANDCHECKSTS_APB_BSY        _BIT(0) /* APB busy*/

/* Register description of NANDCONTROLFLOW */

/* Write the contents of SRAM1 to the NAND flash*/
#define NAND_CTRL_WR_RAM1           _BIT(5)
/* Write the contents of SRAM0 to the NAND flash */
#define NAND_CTRL_WR_RAM0           _BIT(4)
/* Read a defined number of bytes from the NAND flash and store them in SRAM1*/
#define NAND_CTRL_RD_RAM1           _BIT(1)
/* Read a defined number of bytes from the NAND flash and store them in SRAM0*/
#define NAND_CTRL_RD_RAM0           _BIT(0)

/* Register description of ... */
#define NAND_AES_AHB_EN             _BIT(7)
#define NAND_AES_AHB_DCRYPT_RAM1    _BIT(1)
#define NAND_AES_AHB_DCRYPT_RAM0    _BIT(0)




#endif  /* __ASM_ARCH_REGISTERS_H */
